hpmicro/hpm_sdk/soc/HPM6850/HPM6850_svd.xml
        <register>
          <name>phy_rstz</name>
          <description>controls resets and the pll of d-phy</description>
          <addressOffset>0xa0</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000000F</resetMask>
          <fields>
            <field>
              <name>PHY_FORCEPLL</name>
              <description>when the d-phy is in ulps, enable the d-phy pll</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PHY_ENABLECLK</name>
              <description>enable dphy clock lane</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PHY_RSTZ</name>
              <description>make the dphy in reset state when set to 0</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PHY_SHUTDOWNZ</name>
              <description>places the dphy macro in power down mode when set to 0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>phy_if_cfg</name>
          <description>configures the number of active lanes</description>
          <addressOffset>0xa4</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000FF03</resetMask>
          <fields>
            <field>
              <name>PHY_STOP_WAIT_TIME</name>
              <description>configures the minimum time phy needs to stay in stopstate before requesting an highspeed transmission</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>N_LANES</name>
              <description>configures the number of active data lanes</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>phy_ulps_ctrl</name>
          <description>configures entering and leaving ulps</description>
          <addressOffset>0xa8</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000000F</resetMask>
          <fields>
            <field>
              <name>PHY_TXEXITULPSLAN</name>
              <description>ulps mode exit on all active data lanes</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PHY_TXREQULPSLAN</name>
              <description>ulps mode request on all active data lanes</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PHY_TXEXITULPSCLK</name>
              <description>ulps mode exit on clock lane</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PHY_TXREQULPSCLK</name>
              <description>ulps mode request on clock lane</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>phy_tx_triggers</name>
          <description>configures the pins that activate triggers in the d-phy</description>
          <addressOffset>0xac</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000000F</resetMask>
          <fields>
            <field>
              <name>PHY_TX_TRIGGERS</name>
              <description>controls the trigger transmissions</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>phy_status</name>
          <description>contains information about the status of the d-phy</description>
          <addressOffset>0xb0</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00001FFF</resetMask>
          <fields>
            <field>
              <name>PHY_ULPSACTIVENOT3LANE</name>
              <description>indicates the status of ulpsactivenot3lane d-phy signal</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PHY_STOPSTATE3LANE</name>
              <description>This bit indicates the status of phystopstate3lane D-PHY
signal.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PHY_ULPSACTIVENOT2LANE</name>
              <description>This bit indicates the status of ulpsactivenot2lane D-PHY
signa</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PHY_STOPSTATE2LANE</name>
              <description>This bit indicates the status of phystopstate2lane D-PHY
signal</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PHY_ULPSACTIVENOT1LANE</name>
              <description>This bit indicates the status of ulpsactivenot1lane D-PHY
signal</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PHY_STOPSTATE1LANE</name>
              <description>This bit indicates the status of phystopstate1lane D-PHY
signal</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PHY_RXULPSESC0LANE</name>
              <description>This bit indicates the status of rxulpsesc0lane D-PHY signa</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PHY_ULPSACTIVENOT0LANE</name>
              <description>This bit indicates the status of ulpsactivenot0lane D-PHY
signal</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PHY_STOPSTATE0LANE</name>
              <description>This bit indicates the status of phystopstate0lane D-PHY
signal</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PHY_ULPSACTIVENOTCLK</name>
              <description>This bit indicates the status of phyulpsactivenotclk D-PHY
signal</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PHY_STOPSTATECLKLANE</name>
              <description>This bit indicates the status of phystopstateclklane D-PHY
signal</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PHY_DIRECTION</name>
              <description>This bit indicates the status of phydirection D-PHY signal</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PHY_LOCK</name>
              <description>This bit indicates the status of phylock D-PHY signal</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>phy_tst_ctrl0</name>
          <description>controls clock and clear pins of the d-phy vendor specific interface</description>
          <addressOffset>0xb4</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000003</resetMask>
          <fields>
            <field>
              <name>PHY_TESTCLK</name>
              <description>reserve</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PHY_TESTCLR</name>
              <description>reserve</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>phy_tst_ctrl1</name>
          <description>controls data and enable pins of the d-phy</description>
          <addressOffset>0xb8</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0001FFFF</resetMask>
          <fields>
            <field>
              <name>PHY_TESTEN</name>
              <description>reserve</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PHY_TESTDOUT</name>
              <description>reserve</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PHY_TESTDIN</name>
              <description>reserve</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>int_st0</name>
          <description>controls the status of interrupt</description>
          <addressOffset>0xbc</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x001FFFFF</resetMask>
          <fields>
            <field>
              <name>DPHY_ERRORS_4</name>
              <description>indicates LP1 contention error ErrContentionLP1 from lane0</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DPHY_ERRORS_3</name>
              <description>indicates LP0 contention error ErrContentionLP0 from lane0</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DPHY_ERRORS_2</name>
              <description>indicates control error ErrControl from lane0</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DPHY_ERRORS_1</name>
              <description>indicates ErrSyncEsc low-power data transmission synchronization error from lane 0</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DPHY_ERRORS_0</name>
              <description>indicates ErrEsc escape entry error from lane0</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ACK_WITH_ERR_15</name>
              <description>retrives the DSI protocal violation from the acknowledge error report</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ACK_WITH_ERR_14</name>
              <description>retrives the reserved from the acknowledge error report</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ACK_WITH_ERR_13</name>
              <description>retrives the invalid transmission length from the acknowledge error report</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ACK_WITH_ERR_12</name>
              <description>retrieves the dsi vc id invalid from the acknowledge error report</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ACK_WITH_ERR_11</name>
              <description>retrives the not recongnized dsi data type from the acknowledge error report</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ACK_WITH_ERR_10</name>
              <description>retrives the checksum error from the acknowledge error report</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ACK_WITH_ERR_9</name>
              <description>retrives the ECC error multi-bit from the acknowledge error report</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ACK_WITH_ERR8</name>
              <description>retrives the ecc error sigle-bit from the acknowledge error report</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ACK_WITH_ERR7</name>
              <description>retrieves the reserved from the acknowledge error report</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ACK_WITH_ERR6</name>
              <description>retrieves the false control error fro the acknowledge error report</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ACK_WITH_ERR5</name>
              <description>retrives the peripheral timeout error from the acknowledge error report</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ACK_WITH_ERR4</name>
              <description>retrives the LP transmit sync error from the acknowledge error report</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ACK_WITH_ERR3</name>
              <description>retrives the Escap mode entry command error from the acknowledge error report</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ACK_WITH_ERR2</name>
              <description>retrives the EoT sync error from the acknowledge error report</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ACK_WITH_ERR1</name>
              <description>retrives the SoT sync error from the acknowledge error report</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ACK_WITH_ERR0</name>
              <description>retrives the SoT serror from the acknowledge error report</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>int_st1</name>
          <description>the interrupt source related to timeout etc</description>
          <addressOffset>0xc0</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00181FFF</resetMask>
          <fields>
            <field>
              <name>TEAR_REQUEST_ERR</name>
              <description>indicates tear_request has occurred but tear effect is not active in dsi host and device</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DPI_BUFF_PLD_UNDER</name>
              <description>indicates an underflow when reading payload to build dsi packet for video mode</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>GEN_PLD_RECEV_ERR</name>
              <description>indicates that during a generic interface packet read back, the payload FIFO full</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>GEN_PLD_RD_ERR</name>
              <description>indicates that during a DCS read data, the payload FIFO becomes empty</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>GEN_PLD_SEND_ERR</name>
              <description>indicates the payload FIFO become empty when packet build</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>GEN_PLD_WR_ERR</name>
              <description>indicates the system tried to write a payload and FIFO is full</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>GEN_CMD_WR_ERR</name>
              <description>indicates the system tried to write a command and FIFO is full</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DPI_BPLD_WR_ERR</name>
              <description>indicates the payload FIFO is full during a DPI pixel line storage</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>EOPT_ERR</name>
              <description>indicates that the EoTp packet has not been received at the end of the incoming peripheral transmission</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PKT_SIZE_ERR</name>
              <description>indicates that the packet size error has been detected during the packet reception</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CRC_ERR</name>
              <description>indicates that the CRC error has been detected in the reveived packet payload</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ECC_MULTI_ERR</name>
              <description>indicates that the ECC multiple error has been detected in a revieved packet</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ECC_SIGLE_ERR</name>
              <description>indicates that the ECC single error has been detected and corrected in a reveived packet</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TO_LP_TX</name>
              <description>indicates that the low-power reception timeout counter reached the end and contention has been detected</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TO_HS_TX</name>
              <description>indicates that the high-speed transmission timeout counter reached the end and contention has been detected</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
