hpmicro/hpm_sdk/soc/HPM6850/HPM6850_svd.xml
        <register>
          <name>ipi_hbp_time</name>
          <description>configures the video horizontal synchronism back porch time</description>
          <addressOffset>0x94</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000FFF</resetMask>
          <fields>
            <field>
              <name>IPI_HBP_TIME</name>
              <description>configures the Horizontal Synchronism back porch period in pixclk cycles</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ipi_hsd_time</name>
          <description>configures the vedeo Horizontal Sync Delay time</description>
          <addressOffset>0x98</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000FFF</resetMask>
          <fields>
            <field>
              <name>IPI_HSD_TIME</name>
              <description>configures the Horizontal Sync Porch delay period in pixclk cycles</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ipi_hline_time</name>
          <description>configures the overall tiem for each video line</description>
          <addressOffset>0x9c</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00007FFF</resetMask>
          <fields>
            <field>
              <name>IPI_HLIN_TIME</name>
              <description>configures the size of the line time counted in pixclk cycles</description>
              <bitOffset>0</bitOffset>
              <bitWidth>15</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ipi_softrstn</name>
          <description>congtrols the ipi logic reset state</description>
          <addressOffset>0xa0</addressOffset>
          <size>32</size>
          <resetValue>0x00000001</resetValue>
          <resetMask>0x00000001</resetMask>
          <fields>
            <field>
              <name>IPI_SOFTRSTN</name>
              <description>resets ipi one, active low</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ipi_adv_features</name>
          <description>configures advanced features for ipi mode</description>
          <addressOffset>0xac</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x013F3F01</resetMask>
          <fields>
            <field>
              <name>IPI_SYNC_EVENT_MODE</name>
              <description>for camera mode: 0x0- frame start do not trigger any sync event</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EN_EMBEDDED</name>
              <description>allows the use of embendded packets for ipi synchronization events</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EN_BLANKING</name>
              <description>allows the use of blankong packets for IPI synchronization events</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EN_NULL</name>
              <description>allows the use of null packets for IPI synchronization events</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EN_LINE_START</name>
              <description>allows the use of line start packets for ipi synchronization events</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EN_VIDEO</name>
              <description>allows the use of video packets for ipi synchronization events</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LINE_EVENT_SELECTION</name>
              <description>for camero mode, allows manual selection of the packet fo line delimiter as follows: 0x0-controller seletc it automaticlly 0x1-select packets from list programmed in 17:21</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IPI_DT</name>
              <description>datatype to overwrite</description>
              <bitOffset>8</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IPI_DT_OVERWRITE</name>
              <description>ignore datatype of the header using the programmed datatype for decoding</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ipi_vsa_lines</name>
          <description>configures the vertical synchronism active period</description>
          <addressOffset>0xb0</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000003FF</resetMask>
          <fields>
            <field>
              <name>IPI_VSA_LINES</name>
              <description>configures the vertical synchronism active period measured in number of horizontal lines</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ipi_vbp_lines</name>
          <description>configures the verticall back porch period</description>
          <addressOffset>0xb4</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000003FF</resetMask>
          <fields>
            <field>
              <name>IPI_VBP_LINES</name>
              <description>configuress the vertical back porch period measured in number of horizontal lines</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ipi_vfp_lines</name>
          <description>configures the vertical front porch period</description>
          <addressOffset>0xb8</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000003FF</resetMask>
          <fields>
            <field>
              <name>IPI_VFP_LINES</name>
              <description>configures the vertical front porch period measured in number of horizontall lines</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ipi_vactive_lines</name>
          <description>configures the vertical resolution of video</description>
          <addressOffset>0xbc</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00003FFF</resetMask>
          <fields>
            <field>
              <name>IPI_VACTIVE_LINES</name>
              <description>configures the vertical active period measured in bumber of horizontal lines</description>
              <bitOffset>0</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>vc_extension</name>
          <description>active extra bits for virtual channel</description>
          <addressOffset>0xc8</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000001</resetMask>
          <fields>
            <field>
              <name>VCX</name>
              <description>indicates status of virtual channel extension: 0-virtual channel extension is enable  1-legacy mode</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>phy_cal</name>
          <description>contains the calibration signal status from synopsys d-phy</description>
          <addressOffset>0xcc</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000001</resetMask>
          <fields>
            <field>
              <name>RXSKEWCALHS</name>
              <description>a low-to-high transition on rxskewcalhs signal means the the phy has  initiated the de-skew calibration</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>int_st_phy_fatal</name>
          <description>groups the phy interruptions caused by phy packets discarded</description>
          <addressOffset>0xe0</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000103</resetMask>
          <fields>
            <field>
              <name>ERR_DESKEW</name>
              <description>reports whenever data is lost due to an existent skew between lanes greater than 2 rxwordclkhs</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PHY_ERRSOTSYNCHS_1</name>
              <description>start of transmission error on data lane1</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PHY_ERRSOTSYNCHS_0</name>
              <description>start of transmission error on data lane0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>int_msk_phy_fatal</name>
          <description>interrupt mask for int_st_phy_fatal</description>
          <addressOffset>0xe4</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000103</resetMask>
          <fields>
            <field>
              <name>ERR_DESKEW</name>
              <description>mask for err_deskew</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MASK_PHY_ERRSOTSYNCHS_1</name>
              <description>mask for phy_errsotsynchs_1</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MASK_PHY_ERRSOTSYNCHS_0</name>
              <description>mask for phy_errsotsynchs_0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>int_force_phy_fatal</name>
          <description>interrupt force register for test purposes</description>
          <addressOffset>0xe8</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000103</resetMask>
          <fields>
            <field>
              <name>ERR_DESKEW</name>
              <description>force err_deskew</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FORCE_PHY_ERRSOTSYNCHS_1</name>
              <description>force phy_errsotsynchs_1</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FORCE_PHY_ERRSOTSYNCHS_0</name>
              <description>force phy_errsotsynchs_0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>int_st_pkt_fatal</name>
          <description>groups the fatal interruption related with packet construction</description>
          <addressOffset>0xf0</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000001</resetMask>
          <fields>
            <field>
              <name>ERR_ECC_DOUBLE</name>
              <description>header ecc contains at least 2 errors</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>int_msk_pkt_fatal</name>
          <description>interrupt mask for int_st_pkt_fatal</description>
          <addressOffset>0xf4</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000001</resetMask>
          <fields>
            <field>
              <name>MASK_ERR_ECC_DOUBLE</name>
              <description>mask for err_ecc_double</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>int_force_pkt_fatal</name>
          <description>interrupt force register is used for test purpos</description>
          <addressOffset>0xf8</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000001</resetMask>
          <fields>
            <field>
              <name>FORCE_ERR_ECC_DOUBLE</name>
              <description>force err_ecc_double</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>int_st_phy</name>
          <description>interruption caused by phy</description>
          <addressOffset>0x110</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00030003</resetMask>
          <fields>
            <field>
              <name>PHY_ERRESC_1</name>
              <description>start of transmission error on data lane 1</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PHY_ERRESC_0</name>
              <description>start of transmission error on data lane 0</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PHY_ERRSOTHS_1</name>
              <description>start of transmission error on data lane 1</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PHY_ERRSOTHS_0</name>
              <description>start of transmission error on data lane 0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>int_msk_phy</name>
          <description>interrupt mask for int_st_phy</description>
          <addressOffset>0x114</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00030003</resetMask>
          <fields>
            <field>
              <name>MASK_PHY_ERRESC_1</name>
              <description>mask for phy_erresc_1</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MASK_PHY_ERRESC_0</name>
              <description>mask for phy_erresc_0</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MASK_PHY_ERRSOTHS_1</name>
              <description>mask for phy_errsoths_1</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MASK_PHY_ERRSOTHS_0</name>
              <description>mask for phy_errsoths_0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>int_force_phy</name>
          <description>interrupt force register</description>
          <addressOffset>0x118</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00030003</resetMask>
          <fields>
            <field>
              <name>FORCE_PHY_ERRESC_1</name>
              <description>force phy_erresc_1</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FORCE_PHY_ERRESC_0</name>
              <description>force phy_erresc_0</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FORCE_PHY_ERRSOTHS_1</name>
              <description>force phy_errsoths_1</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FORCE_PHY_ERRSOTHS_0</name>
              <description>force phy_errsoths_0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>int_st_ipi_fatal</name>
          <description>fatal interruption caused by ipi interface</description>
          <addressOffset>0x140</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000003F</resetMask>
          <fields>
            <field>
              <name>INT_EVENT_FIFO_OVERFLOW</name>
              <description>reporting internal fifo overflow</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PIXEL_IF_HLINE_ERR</name>
              <description>horizontal line time error</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PIXEL_IF_FIFO_NEMPTY_FS</name>
              <description>the fifo of pixel interface is not empty at the starat of a new frame</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PIXEL_IF_FRAME_SYNC_ERR</name>
              <description>whenever in controller mode, notifies if a new frame is received but previous has not been completed</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PIXEL_IF_FIFO_OVERFLOW</name>
              <description>the fifo of pixel interface has lost information because some data arrived and fifo is already full</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PIXEL_IF_FIFO_UNDERFLOW</name>
              <description>the fifo has become empty before the expected bumber of pixels could be extracted to the pixel intefcese</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
