hpmicro/hpm_sdk/soc/HPM6850/HPM6850_svd.xml
        <register>
          <name>RANKCTL</name>
          <description>Description: Rank Control Register</description>
          <addressOffset>0xf4</addressOffset>
          <size>32</size>
          <resetValue>0x0000066F</resetValue>
          <resetMask>0x00000FFF</resetMask>
          <fields>
            <field>
              <name>DIFF_RANK_WR_GAP</name>
              <description>Description: Only present for multi-rank configurations. Indicates the number of clocks of gap in data responses when performing consecutive writes to different ranks.
This is used to switch the delays in the PHY to match the rank requirements.
The value programmed in this register takes care of the ODT switch off timing requirement when switching ranks during writes.
For configurations with MEMC_FREQ_RATIO=2, program this to (N/2) and round it up to the next integer value. N is value required by PHY, in terms of PHY clocks.
Value After Reset: 0x6
Exists: MEMC_NUM_RANKS&gt;1</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DIFF_RANK_RD_GAP</name>
              <description>Description: Only present for multi-rank configurations. Indicates the number of clocks of gap in data responses when performing consecutive reads to different ranks.
This is used to switch the delays in the PHY to match the rank requirements.
The value programmed in this register takes care of the ODT switch off timing requirement when switching ranks during reads.
For configurations with MEMC_FREQ_RATIO=2, program this to (N/2) and round it up to the next integer value. N is value required by PHY, in terms of PHY clocks.
Value After Reset: 0x6
Exists: MEMC_NUM_RANKS&gt;1</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MAX_RANK_RD</name>
              <description>Description: Only present for multi-rank configurations. Background: Reads to the same rank can be performed back-to-back. Reads to different ranks require additional gap
dictated by the register RANKCTL.diff_rank_rd_gap. This is
to avoid possible data bus contention as well as to give PHY enough time to switch the delay when changing ranks. The uMCTL2 arbitrates for bus access on a cycle-by-cycle basis; therefore after a read is scheduled, there are few clock cycles (determined by the value on diff_rank_rd_gap register) in which only reads from the same rank are eligible to be scheduled. This prevents reads from other ranks from having fair access to the data bus.
This parameter represents the maximum number of reads that can be scheduled consecutively to the same rank. After this number is reached, a delay equal to RANKCTL.diff_rank_rd_gap is inserted by the scheduler to allow all ranks a fair opportunity to be scheduled. Higher numbers increase bandwidth utilization, lower numbers increase fairness.
This feature can be DISABLED by setting this register to 0. When set to 0, the Controller will stay on the same rank as long as commands are available for it.
Minimum programmable value is 0 (feature disabled) and maximum programmable value is 0xF.
Feature limitation: max_rank_rd feature works as described only in the mode in which one command at the DDRC input results in one DFI command at the output. An example of this mode is: BL8 hardware configuration (MEMC_BURST_LENGTH=8) and Full bus width mode (MSTR.data_bus_width=2'b00) and BL8 mode of operation (MSTR.burst_rdwr=4'b0100). In modes where single HIF command results in multiple DFI commands (eg: Half Bus Width, BL4 etc.), the same rank commands would be serviced for as long as they are available, which is equivalent to this feature being disabled.
FOR PERFORMANCE ONLY.
Value After Reset: 0xf
Exists: MEMC_NUM_RANKS&gt;1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DRAMTMG0</name>
          <description>Description: SDRAM Timing Register 0</description>
          <addressOffset>0x100</addressOffset>
          <size>32</size>
          <resetValue>0x0F101B0F</resetValue>
          <resetMask>0x7F3F7F3F</resetMask>
          <fields>
            <field>
              <name>WR2PRE</name>
              <description>Description: Minimum time between write and precharge to same bank.
Unit: Clocks
Specifications: WL + BL/2 + tWR = approximately 8 cycles + 15 ns = 14 clocks @400MHz and less for lower frequencies where:
WL = write latency
BL = burst length. This must match the value programmed in the BL bit of the mode register to the SDRAM. BST (burst terminate) is not supported at present.
tWR = Write recovery time. This comes directly from the SDRAM specification.
Add one extra cycle for LPDDR2/LPDDR3 for this parameter. For configurations with MEMC_FREQ_RATIO=2, 1T mode, divide the above value by 2. No rounding up.
For configurations with MEMC_FREQ_RATIO=2, 2T mode, divide the above value by 2 and add 1. No rounding up.
Value After Reset: 0xf
Exists: Always</description>
              <bitOffset>24</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>T_FAW</name>
              <description>Description: tFAW Valid only when 8 or more banks(or banks x bank groups) are present.
In 8-bank design, at most 4 banks must be activated in a rolling window of tFAW cycles.
For configurations with MEMC_FREQ_RATIO=2, program this to (tFAW/2) and round up to next integer value.
In a 4-bank design, set this register to 0x1 independent of the MEMC_FREQ_RATIO configuration.
Unit: Clocks
Value After Reset: 0x10
Exists: Always</description>
              <bitOffset>16</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>T_RAS_MAX</name>
              <description>Description: tRAS(max): Maximum time between activate and precharge to same bank. This is the maximum time that a page can be kept open
Minimum value of this register is 1. Zero is invalid.
For configurations with MEMC_FREQ_RATIO=2, program this to (tRAS(max)-1)/2. No rounding up.
Unit: Multiples of 1024 clocks. Value After Reset: 0x1b Exists: Always</description>
              <bitOffset>8</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>T_RAS_MIN</name>
              <description>Description: tRAS(min): Minimum time between activate and precharge to the same bank.
For configurations with MEMC_FREQ_RATIO=2, 1T mode, program this to tRAS(min)/2. No rounding up.
For configurations with MEMC_FREQ_RATIO=2, 2T mode, program this to (tRAS(min)/2 + 1). No rounding up of the division operation.
Unit: Clocks
Value After Reset: 0xf
Exists: Always</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DRAMTMG1</name>
          <description>Description: SDRAM Timing Register 1</description>
          <addressOffset>0x104</addressOffset>
          <size>32</size>
          <resetValue>0x00080414</resetValue>
          <resetMask>0x001F1F7F</resetMask>
          <fields>
            <field>
              <name>T_XP</name>
              <description>Description: tXP: Minimum time after power-down exit to any operation. For DDR3, this should be programmed to tXPDLL if slow powerdown exit is selected in MR0[12].
If C/A parity for DDR4 is used, set to (tXP+PL) instead. For configurations with MEMC_FREQ_RATIO=2, program this to (tXP/2) and round it up to the next integer value.
Units: Clocks
Value After Reset: 0x8
Exists: Always</description>
              <bitOffset>16</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RD2PRE</name>
              <description>Description: tRTP: Minimum time from read to precharge of same bank.
DDR2: tAL + BL/2 + max(tRTP, 2) - 2
DDR3: tAL + max (tRTP, 4)
DDR4: Max of following two equations:	tAL + max (tRTP, 4) or,	RL + BL/2 - tRP.
mDDR: BL/2
LPDDR2: Depends on if it's LPDDR2-S2 or LPDDR2-S4: LPDDR2-S2: BL/2 + tRTP - 1.	LPDDR2-S4: BL/2 + max(tRTP,2) - 2.
LPDDR3: BL/2 + max(tRTP,4) - 4
For configurations with MEMC_FREQ_RATIO=2, 1T mode, divide the above value by 2. No rounding up.
For configurations with MEMC_FREQ_RATIO=2, 2T mode, divide the above value by 2 and add 1. No rounding up of division operation.
Unit: Clocks.
Value After Reset: 0x4
Exists: Always</description>
              <bitOffset>8</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>T_RC</name>
              <description>Description: tRC: Minimum time between activates to same bank.
For configurations with MEMC_FREQ_RATIO=2, program this to (tRC/2) and round up to next integer value.
Unit: Clocks.
Value After Reset: 0x14
Exists: Always</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DRAMTMG2</name>
          <description>Description: SDRAM Timing Register 2</description>
          <addressOffset>0x108</addressOffset>
          <size>32</size>
          <resetValue>0x0000060D</resetValue>
          <resetMask>0x00001F3F</resetMask>
          <fields>
            <field>
              <name>RD2WR</name>
              <description>Description: DDR2/3/mDDR: RL + BL/2 + 2 - WL DDR4: RL + BL/2 + 1 + WR_PREAMBLE - WL
LPDDR2/LPDDR3: RL + BL/2 + RU(tDQSCKmax/tCK) + 1 - WL.
Minimum time from read command to write command. Include time for bus turnaround and all per-bank, per-rank, and global constraints.
Unit: Clocks. Where:
WL = write latency
BL = burst length. This must match the value programmed in the BL bit of the mode register to the SDRAM
RL = read latency = CAS latency
WR_PREAMBLE = write preamble. This is unique to DDR4.
For configurations with MEMC_FREQ_RATIO=2, divide the value calculated using the above equation by 2, and round it up to next integer.
Value After Reset: 0x6
Exists: Always</description>
              <bitOffset>8</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WR2RD</name>
              <description>Description: DDR4: WL + BL/2 + tWTR_L Others: WL + BL/2 + tWTR
In DDR4, minimum time from write command to read command for same bank group. In others, minimum time from write command to read command. Includes time for bus turnaround, recovery times, and all per-bank, per-rank, and global constraints.
Unit: Clocks. Where:
WL = write latency
BL = burst length. This must match the value programmed in the BL bit of the mode register to the SDRAM
tWTR_L = internal write to read command delay for same bank group. This comes directly from the SDRAM specification.
tWTR = internal write to read command delay. This comes directly from the SDRAM specification.
Add one extra cycle for LPDDR2/LPDDR3 operation.
For configurations with MEMC_FREQ_RATIO=2, divide the value calculated using the above equation by 2, and round it up to next integer.
Value After Reset: 0xd
Exists: Always</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DRAMTMG3</name>
          <description>Description: SDRAM Timing Register 3</description>
          <addressOffset>0x10c</addressOffset>
          <size>32</size>
          <resetValue>0x0000400C</resetValue>
          <resetMask>0x0003F3FF</resetMask>
          <fields>
            <field>
              <name>T_MRD</name>
              <description>Description: tMRD: Cycles between load mode commands. If MEMC_DDR3_OR_4 = 0, this parameter is also used to define the cycles between load mode command and following non-load mode command.
For configurations with MEMC_FREQ_RATIO=2, program this to (tMRD/2) and round it up to the next integer value.
If C/A parity for DDR4 is used, set to tMRD_PAR(tMOD+PL) instead
Value After Reset: 0x4
Exists: Always</description>
              <bitOffset>12</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>T_MOD</name>
              <description>Description: tMOD: Present if MEMC_DDR3_OR_4 = 1. Cycles between load mode command and following non-load mode command. This is required to be programmed even when a design that supports DDR3/4 is running in DDR2 mode.
If C/A parity for DDR4 is used, set to tMOD_PAR(tMOD+PL) instead
Set to tMOD if MEMC_FREQ_RATIO=1, or tMOD/2 (rounded up to next integer) if MEMC_FREQ_RATIO=2. Note that if using RDIMM, depending on the PHY, it may be necessary to use a value of tMOD + 1 or (tMOD + 1)/2 to compensate for the extra cycle of latency applied to mode register writes by the RDIMM chip
Value After Reset: "(MEMC_DDR3_EN==1 || MEMC_DDR4_EN==1 ) ? 0xc : 0x0"
Exists: MEMC_DDR3==1 || MEMC_DDR4==1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DRAMTMG4</name>
          <description>Description: SDRAM Timing Register 4</description>
          <addressOffset>0x110</addressOffset>
          <size>32</size>
          <resetValue>0x05040405</resetValue>
          <resetMask>0x1F070F1F</resetMask>
          <fields>
            <field>
              <name>T_RCD</name>
              <description>Description: tRCD - tAL: Minimum time from activate to read or write command to same bank.
For configurations with MEMC_FREQ_RATIO=2, program this to ((tRCD - tAL)/2) and round it up to the next integer value.
Minimum value allowed for this register is 1, which implies minimum (tRCD - tAL) value to be 2 in configurations with MEMC_FREQ_RATIO=2.
Unit: Clocks.
Value After Reset: 0x5
Exists: Always</description>
              <bitOffset>24</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>T_CCD</name>
              <description>Description: DDR4: tCCD_L: This is the minimum time between two reads or two writes for same bank group. Others: tCCD: This is the minimum time between two reads
or two writes.
For configurations with MEMC_FREQ_RATIO=2, program this to (tCCD_L/2 or tCCD/2) and round it up to the next integer value.
Unit: clocks.
Value After Reset: 0x4
Exists: Always</description>
              <bitOffset>16</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>T_RRD</name>
              <description>Description: DDR4: tRRD_L: Minimum time between activates from bank "a" to bank "b" for same bank group. Others: tRRD: Minimum time between activates from bank
"a" to bank "b"
For configurations with MEMC_FREQ_RATIO=2, program this to (tRRD_L/2 or tRRD/2) and round it up to the next integer value.
Unit: Clocks.
Value After Reset: 0x4
Exists: Always</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>T_RP</name>
              <description>Description: tRP: Minimum time from precharge to activate of same bank.
For configurations with MEMC_FREQ_RATIO=2, program this to (tRP/2 + 1). No round up of the fraction.
Unit: Clocks.
Value After Reset: 0x5
Exists: Always</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DRAMTMG5</name>
          <description>Description: SDRAM Timing Register 5</description>
          <addressOffset>0x114</addressOffset>
          <size>32</size>
          <resetValue>0x05050403</resetValue>
          <resetMask>0x0F0F3F1F</resetMask>
          <fields>
            <field>
              <name>T_CKSRX</name>
              <description>Description: This is the time before Self Refresh Exit that CK is maintained as a valid clock before issuing SRX. Specifies the clock stable time before SRX.
Recommended settings:
mDDR: 1
LPDDR2: 2
LPDDR3: 2
DDR2: 1
DDR3: tCKSRX
DDR4: tCKSRX
For configurations with MEMC_FREQ_RATIO=2, program this to recommended value divided by two and round it up to next integer.
Value After Reset: 0x5
Exists: Always</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>T_CKSRE</name>
              <description>Description: This is the time after Self Refresh Down Entry that CK is maintained as a valid clock. Specifies the clock disable delay after SRE.
Recommended settings:
mDDR: 0
LPDDR2: 2
LPDDR3: 2
DDR2: 1
DDR3: max (10 ns, 5 tCK)
DDR4: max (10 ns, 5 tCK)
For configurations with MEMC_FREQ_RATIO=2, program this to recommended value divided by two and round it up to next integer.
Value After Reset: 0x5
Exists: Always</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>T_CKESR</name>
              <description>Description: Minimum CKE low width for Self refresh entry to exit timing im memory clock cycles.
Recommended settings:
mDDR: tRFC
LPDDR2: tCKESR
LPDDR3: tCKESR
DDR2: tCKE
DDR3: tCKE + 1
DDR4: tCKE + 1
For configurations with MEMC_FREQ_RATIO=2, program this to recommended value divided by two and round it up to next integer.
Value After Reset: 0x4
Exists: Always</description>
              <bitOffset>8</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>T_CKE</name>
              <description>Description: Minimum number of cycles of CKE HIGH/LOW during power-down and self refresh.
LPDDR2/LPDDR3 mode: Set this to the larger of tCKE or tCKESR
Non-LPDDR2/non-LPDDR3 designs: Set this to tCKE value.
For configurations with MEMC_FREQ_RATIO=2, program this to (value described above)/2 and round it up to the next integer value.
Unit: Clocks.
Value After Reset: 0x3
Exists: Always</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DRAMTMG8</name>
          <description>Description: SDRAM Timing Register 8</description>
          <addressOffset>0x120</addressOffset>
          <size>32</size>
          <resetValue>0x00004405</resetValue>
          <resetMask>0x00007F7F</resetMask>
          <fields>
            <field>
              <name>T_XS_DLL_X32</name>
              <description>Description: tXSDLL: Exit Self Refresh to commands requiring a locked DLL.
For configurations with MEMC_FREQ_RATIO=2, program this to the above value divided by 2 and round up to next integer value.
Unit: Multiples of 32 clocks.
Note: In LPDDR2/LPDDR3/Mobile DDR mode, t_xs_x32 and t_xs_dll_x32 must be set the same values derived from tXSR.
Value After Reset: 0x44
Exists: Always</description>
              <bitOffset>8</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>T_XS_X32</name>
              <description>Description: tXS: Exit Self Refresh to commands not requiring a locked DLL.
For configurations with MEMC_FREQ_RATIO=2, program this to the above value divided by 2 and round up to next integer value.
Unit: Multiples of 32 clocks.
Note: In LPDDR2/LPDDR3/Mobile DDR mode, t_xs_x32 and t_xs_dll_x32 must be set the same values derived from tXSR.
Value After Reset: 0x5
Exists: Always</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
