hpmicro/hpm_sdk/soc/HPM6850/HPM6850_svd.xml
          <register>
            <name>CTRL</name>
            <description>Description: Port n Control Register</description>
            <addressOffset>0x8c</addressOffset>
            <size>32</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x00000001</resetMask>
            <fields>
              <field>
                <name>PORT_EN</name>
                <description>Description: Enables port n.
Value After Reset: "UMCTL2_PORT_EN_RESET_VALUE"
Exists: Always</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>QOS0</name>
            <description>Description: Port n Read QoS Configuration Register 0</description>
            <addressOffset>0x90</addressOffset>
            <size>32</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x0033000F</resetMask>
            <fields>
              <field>
                <name>RQOS_MAP_REGION1</name>
                <description>Description: This bitfield indicates the traffic class of region
1.	Valid values are:	0: LPR, 1: VPR, 2: HPR. For dual address queue configurations, region1 maps to the blue address queue. In this case, valid values are 0: LPR and 1: VPR only.	When VPR support is disabled (UMCTL2_VPR_EN = 0) and traffic class of region 1 is set to 1 (VPR) then VPR traffic is aliased to LPR traffic.
Value After Reset: 0x0
Exists: Always</description>
                <bitOffset>20</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>RQOS_MAP_REGION0</name>
                <description>Description: This bitfield indicates the traffic class of region
0. Valid values are: 0: LPR, 1: VPR, 2: HPR. For dual address queue configurations, region 0 maps to the blue address queue. In this case, valid values are 0: LPR and 1: VPR only.	When VPR support is disabled (UMCTL2_VPR_EN = 0) and traffic class of region0 is set to 1 (VPR) then VPR traffic is aliased to LPR traffic.
Value After Reset: 0x0
Exists: Always</description>
                <bitOffset>16</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>RQOS_MAP_LEVEL1</name>
                <description>Description: Separation level1 indicating the end of region0 mapping; start of region0 is 0. Possible values for level1 are 0 to 13(for dual RAQ) or 0 to 14(for single RAQ) which corresponds to arqos.	Note that for PA, arqos values are used directly as port priorities, where the higher the value corresponds to higher port priority.	All of the map_level* registers must be set to distinct values.
Value After Reset: 0x0
Exists: Always</description>
                <bitOffset>0</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>QOS1</name>
            <description>Description: Port n Read QoS Configuration Register 1</description>
            <addressOffset>0x94</addressOffset>
            <size>32</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x07FF07FF</resetMask>
            <fields>
              <field>
                <name>RQOS_MAP_TIMEOUTR</name>
                <description>Description: Specifies the timeout value for transactions mapped to the red address queue.
Value After Reset: 0x0
Exists: Always</description>
                <bitOffset>16</bitOffset>
                <bitWidth>11</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>RQOS_MAP_TIMEOUTB</name>
                <description>Description: Specifies the timeout value for transactions mapped to the blue address queue.
Value After Reset: 0x0
Exists: Always</description>
                <bitOffset>0</bitOffset>
                <bitWidth>11</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>WQOS0</name>
            <description>Description: Port n Write QoS Configuration Register 0</description>
            <addressOffset>0x98</addressOffset>
            <size>32</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x0033000F</resetMask>
            <fields>
              <field>
                <name>WQOS_MAP_REGION1</name>
                <description>Description: This bitfield indicates the traffic class of region
1. Valid values are:
0: NPW
1: VPW
When VPW support is disabled (UMCTL2_VPW_EN = 0) and traffic class of region 1 is set to 1 (VPW) then VPW traffic is aliased to NPW traffic.
Value After Reset: 0x0
Exists: Always</description>
                <bitOffset>20</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>WQOS_MAP_REGION0</name>
                <description>Description: This bitfield indicates the traffic class of region
0. Valid values are:
0: NPW
1: VPW
When VPW support is disabled (UMCTL2_VPW_EN = 0) and traffic class of region0 is set to 1 (VPW) then VPW traffic is aliased to NPW traffic.
Value After Reset: 0x0
Exists: Always</description>
                <bitOffset>16</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>WQOS_MAP_LEVEL</name>
                <description>Description: Separation level indicating the end of region0 mapping; start of region0 is 0. Possible values for level1 are 0 to 14 which corresponds to awqos.	Note that for PA, awqos values are used directly as port priorities, where the higher the value corresponds to higher port priority.
Value After Reset: 0x0
Exists: Always</description>
                <bitOffset>0</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>WQOS1</name>
            <description>Description: Port n Write QoS Configuration Register 1</description>
            <addressOffset>0x9c</addressOffset>
            <size>32</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x000007FF</resetMask>
            <fields>
              <field>
                <name>WQOS_MAP_TIMEOUT</name>
                <description>Description: Specifies the timeout value for write transactions.
Value After Reset: 0x0
Exists: Always</description>
                <bitOffset>0</bitOffset>
                <bitWidth>11</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster>
          <dim>4</dim>
          <dimIncrement>0x8</dimIncrement>
          <dimIndex>0,1,2,3</dimIndex>
          <name>SAR[%s]</name>
          <description>no description available</description>
          <addressOffset>0xf04</addressOffset>
          <register>
            <name>BASE</name>
            <description>Description: SAR Base Address Register n</description>
            <addressOffset>0x0</addressOffset>
            <size>32</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>BASE_ADDR</name>
                <description>Description: Base address for address region n specified as awaddr[UMCTL2_A_ADDRW-1:x] and araddr[UMCTL2_A_ADDRW-1:x] where x is determined by the minimum block size parameter UMCTL2_SARMINSIZE: (x=log2(block size)).
Value After Reset: 0x0
Exists: Always</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>SIZE</name>
            <description>Description: SAR Size Register n</description>
            <addressOffset>0x4</addressOffset>
            <size>32</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x000000FF</resetMask>
            <fields>
              <field>
                <name>NBLOCKS</name>
                <description>Description: Number of blocks for address region n. This register determines the total size of the region in multiples of minimum block size as specified by the hardware parameter UMCTL2_SARMINSIZE. The register value is encoded as number of blocks = nblocks + 1.
Value After Reset: 0x0
Exists: Always</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
        </cluster>
        <register>
          <name>SBRCTL</name>
          <description>Description: Scrubber Control Register</description>
          <addressOffset>0xf24</addressOffset>
          <size>32</size>
          <resetValue>0x0000FF10</resetValue>
          <resetMask>0x001FFF77</resetMask>
          <fields>
            <field>
              <name>SCRUB_INTERVAL</name>
              <description>Description: Scrub interval. (512 x scrub_interval) number of clock cycles between two scrub read commands. If set to 0,	scrub commands are issued back-to-back. This mode of operation (scrub_interval=0) can typically be used for scrubbing the full range of memory at once	before or after SW controlled low power operations. After completing the full range of scrub while scrub_interval=0, scrub_done register is set and	sbr_done_intr interrupt signal is asserted.
Value After Reset: 0xff
Exists: UMCTL2_SBR_EN_1==1</description>
              <bitOffset>8</bitOffset>
              <bitWidth>13</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SCRUB_BURST</name>
              <description>Description: Scrub burst count. Determines the number of back-to-back scrub read commands that can be issued together		when the controller is in one of the HW controlled low power modes. During low power, the period of the scrub burst	becomes \"scrub_burst*scrub_interval\" cycles.
During normal operation mode of the controller (ie. not in power-down	or self refresh), scrub_burst is ignored and only one scrub command is generated.	Valid values are: 1: 1 read, 2: 4 reads, 3: 16 reads, 4: 64 reads, 5: 256 reads,
6: 1024 reads.
Value After Reset: 0x1
Exists: UMCTL2_SBR_EN_1==1</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SCRUB_MODE</name>
              <description>Description: scrub_mode:0 ECC scrubber will perform reads	scrub_mode:1 ECC scrubber will perform writes Value After Reset: 0x0
Exists: UMCTL2_SBR_EN_1==1</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SCRUB_DURING_LOWPOWER</name>
              <description>Description: Continue scrubbing during low power. If set to 1, burst of scrubs will be issued	in HW controlled low power modes. There are two such modes: automatically initiated		by idleness or initiated by HW low-power (LP) interface. If set to 0, the scrubber		will not attempt to send commands while the DDRC is in HW controlled low power modes.	In this case, the scrubber will remember the last address issued and will automatically continue	from there when the DDRC exits the LP mode.
Value After Reset: 0x0
Exists: UMCTL2_SBR_EN_1==1</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SCRUB_EN</name>
              <description>Description: Enable ECC scrubber. If set to 1, enables the scrubber to generate background	read commands after the memories are initialized. If set to 0, disables the scrubber, resets the address generator to 0	and clears the scrubber status. This bitfield must be accessed separately from the other bitfields in this register.
Value After Reset: 0x0
Exists: UMCTL2_SBR_EN_1==1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SBRSTAT</name>
          <description>Description: Scrubber Status Register</description>
          <addressOffset>0xf28</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000003</resetMask>
          <fields>
            <field>
              <name>SCRUB_DONE</name>
              <description>Description: Scrubber done. Controller sets this bit to 1, after full range of addresses are scrubbed once while scrub_interval is set to 0.	Cleared if scrub_en is set to 0 (scrubber disabled) or scrub_interval is set to a non-zero value for normal scrub operation.	The interrupt signal, sbr_done_intr, is equivalent to this status bitfield.
Value After Reset: 0x0
Exists: UMCTL2_SBR_EN_1==1</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SCRUB_BUSY</name>
              <description>Description: Scrubber busy. Controller sets this bit to 1 when the scrubber logic has outstanding read commands being executed.	Cleared when there are no active outstanding scrub reads in the system.
Value After Reset: 0x0
Exists: UMCTL2_SBR_EN_1==1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SBRWDATA0</name>
          <description>Description: Scrubber Write Data Pattern0</description>
          <addressOffset>0xf2c</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SCRUB_PATTERN0</name>
              <description>Description: ECC Scrubber write data pattern for data bus[31:0]
Value After Reset: 0x0
Exists: UMCTL2_SBR_EN_1==1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
