hpmicro/hpm_sdk/soc/HPM6850/HPM6850_svd.xml
        <register>
          <name>ctrl_para0</name>
          <description>dphy control parameter</description>
          <addressOffset>0x58</addressOffset>
          <size>32</size>
          <resetValue>0x000000E0</resetValue>
          <resetMask>0x000000FF</resetMask>
          <fields>
            <field>
              <name>VBG_RDY</name>
              <description>the indicator signal of reference generator is ready</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>EN_ULPRX_D0</name>
              <description>ulp-rx enable for lane0</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EN_LPRX_D0</name>
              <description>lp-rx enable for lane0</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EN_LPCD_D0</name>
              <description>lp-cd enable for lane0</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PWON_SEL</name>
              <description>select the cource of PMA power on control signals</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PWON_PLL</name>
              <description>power on pll high active</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PWON_DSI</name>
              <description>power on all dsi lane</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SU_IDDQ_EN</name>
              <description>power down all modules inside su includes ivref, r-calibration and pll, high effective</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>pll_ctrl_para0</name>
          <description>dphy pll control parameter</description>
          <addressOffset>0x5c</addressOffset>
          <size>32</size>
          <resetValue>0x01029AB6</resetValue>
          <resetMask>0x0FFFFFFF</resetMask>
          <fields>
            <field>
              <name>PLL_LOCK</name>
              <description>pll lock indication</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RATE</name>
              <description>data reate control signal</description>
              <bitOffset>24</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REFCLK_DIV</name>
              <description>input reference clock divider ratio control</description>
              <bitOffset>19</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PLL_DIV</name>
              <description>pll loop divider ratio control</description>
              <bitOffset>4</bitOffset>
              <bitWidth>15</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DSI_PIXELCLK_DIV</name>
              <description>pixell clock divided from pll output</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>rcal_ctrl</name>
          <description>dphy calibration control parameter</description>
          <addressOffset>0x64</addressOffset>
          <size>32</size>
          <resetValue>0x00002E00</resetValue>
          <resetMask>0x00003FFF</resetMask>
          <fields>
            <field>
              <name>RCAL_EN</name>
              <description>enable hs-tx output impedance trimming</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RCAL_TRIM</name>
              <description>default value of hs-tx output resistance configure</description>
              <bitOffset>9</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RCAL_CTRL</name>
              <description>resistor calibration control, reserved for test</description>
              <bitOffset>1</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RCAL_DONE</name>
              <description>hs-tx output impedance trimming done indicator signal</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>trim_para</name>
          <description>dphy trimming parameter</description>
          <addressOffset>0x68</addressOffset>
          <size>32</size>
          <resetValue>0x00003322</resetValue>
          <resetMask>0x00003FFF</resetMask>
          <fields>
            <field>
              <name>HSTX_AMP_TRIM</name>
              <description>hs-tx output vod trimming for lane-0~4</description>
              <bitOffset>11</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LPTX_SR_TRIM</name>
              <description>lp-tx output slew-rate trimming for lane0~4</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LPRX_VREF_TRIM</name>
              <description>lp-rx input threshold voltage trimming for lane0</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LPCD_VREF_TRIM</name>
              <description>lp-cd input threshold voltage trimming for lane0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>test_para0</name>
          <description>dphy test control parameter</description>
          <addressOffset>0x6c</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x007FFFFF</resetMask>
          <fields>
            <field>
              <name>ERROR_NUM</name>
              <description>the byte num of mismatch data of lane in bist mode</description>
              <bitOffset>17</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>BIST_N_DONE</name>
              <description>indicate prbs7 bist test is done</description>
              <bitOffset>12</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>BIST_N_OK</name>
              <description>indicate prbs7 bist test is ok</description>
              <bitOffset>7</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ATEST_EN</name>
              <description>analog test signal enable</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ATEST_SEL</name>
              <description>analog test signal select</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FSET_EN</name>
              <description>enable fast transmission between lp-tx and hs-tx</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FT_SEL</name>
              <description>pt/ft test mode select</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>test_para1</name>
          <description>dphy bist test control parameter</description>
          <addressOffset>0x70</addressOffset>
          <size>32</size>
          <resetValue>0x009C40C0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CHECK_NUM</name>
              <description>the byte num of prbs bist check num</description>
              <bitOffset>10</bitOffset>
              <bitWidth>22</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ERR_THRESHOLD</name>
              <description>the threshold of prbs bit error</description>
              <bitOffset>6</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BIST_BIT_ERROR</name>
              <description>enable insert error in bist test pattern</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BIST_EN</name>
              <description>bist enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BIST_SEL</name>
              <description>bist mode select</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRBS_SEL</name>
              <description>prbs generator and checker pattern select signal</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>misc_para</name>
          <description>dphy control parameter</description>
          <addressOffset>0x74</addressOffset>
          <size>32</size>
          <resetValue>0x0000007F</resetValue>
          <resetMask>0x000007FF</resetMask>
          <fields>
            <field>
              <name>DLL_SEL</name>
              <description>the phase select of clk_rxesc</description>
              <bitOffset>7</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LANE_NUM</name>
              <description>the number of active data lanes</description>
              <bitOffset>5</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PHYERR_MASK</name>
              <description>mask the phy error</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>clane_para4</name>
          <description>dphy clock lane control parameter</description>
          <addressOffset>0x78</addressOffset>
          <size>32</size>
          <resetValue>0x00000100</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>T_WAKEUP_C</name>
              <description>the number of byteclk cycles from exiting ultra low power state to enabling the low-power driver</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>interface_para</name>
          <description>dphy clock lane control parameter</description>
          <addressOffset>0x7c</addressOffset>
          <size>32</size>
          <resetValue>0x00000301</resetValue>
          <resetMask>0x0000FFFF</resetMask>
          <fields>
            <field>
              <name>TXREADYESC_EXTEND_VLD</name>
              <description>the extend length of txreadyesc</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RXVALIDESC_EXTEND_VLD</name>
              <description>the extend length of rxvalidesc</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>pcs_reserved_pin_para</name>
          <description>reserved the pins for pcs</description>
          <addressOffset>0x80</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000001F</resetMask>
          <fields>
            <field>
              <name>CLK_TXHS_SEL_INNER</name>
              <description>select the clock source of clk_txhs in pcs</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INV_CLK_TXHS</name>
              <description>clk_txhs inverter signal</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INV_CLK_TXESC</name>
              <description>clk_txesc inverter signal</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INV_PCLK</name>
              <description>pclk inverter signal</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INV_DSI_RCLK</name>
              <description>pma clock dsi_rclk_i inverter signal</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>clane_data_para</name>
          <description>parallel data about clock lane parameter</description>
          <addressOffset>0x8c</addressOffset>
          <size>32</size>
          <resetValue>0x000000AA</resetValue>
          <resetMask>0x000001FF</resetMask>
          <fields>
            <field>
              <name>CLANE_DATA_SEL</name>
              <description>select the data about clock lane</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CLANE_DATA</name>
              <description>the parallel data about clock lane</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>pma_lane_sel_para</name>
          <description>pma about clock lane select parameter</description>
          <addressOffset>0x90</addressOffset>
          <size>32</size>
          <resetValue>0x0000000D</resetValue>
          <resetMask>0x0000000F</resetMask>
          <fields>
            <field>
              <name>PMA_DLANE4_SEL</name>
              <description>select the channel 4 as the data lane</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMA_DLANE3_SEL</name>
              <description>select the channel 3 as the data lane</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMA_DLANE2_SEL</name>
              <description>select the channel 2 as the data lane</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMA_DLANE1_SEL</name>
              <description>select the channel 1 as the data lane</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
