hpmicro/hpm_sdk/soc/HPM6850/HPM6850_svd.xml
        <register>
          <name>EMR</name>
          <description>No description available</description>
          <alternateGroup>UNION_MR1</alternateGroup>
          <addressOffset>0x58</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>QOFF</name>
              <description>Output Enable/Disable: When ‘0’, all outputs function normal; when ‘1’ all SDRAM outputs are disabled removing output buffer current. This feature is intended to be
used for IDD characterization of read current and should not be used in normal operation.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RDQS</name>
              <description>RDQS Enable/Disable: When enabled (‘1’), RDQS is identical in function and timing to data strobe DQS during a read, and ignored during a write. A ‘0’ disables the SDRAM from driving RDQS. The Controller does not allow the user to change this bit.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DQS</name>
              <description>DQS_b Enable/Disable: When ‘0’, DQS_b is the complement of the differential data strobe pair DQS/DQS_b. When ‘1’, DQS is used in a single-ended mode and the DQS_b pin is disabled. Also used to similarly enable/disable RDQS_b if RDQS is enabled. The Controller does not allow the user to change this bit.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OCD</name>
              <description>Off-Chip Driver (OCD) Impedance Calibration: Used to calibrate and match pull-up to pull- down impedance to 18  nominal (refer to the SDRAM datasheet for details). Valid values are:
000 = OCD calibration mode exit 001 = Drive (1) pull-up
010 = Drive (0) pull-down
100 = OCD enter adjust mode 111 = OCD calibration default
All other settings are reserved and should not be used. Note that OCD is not supported by all vendors. Refer to the SDRAM datasheet for details on the recommended OCD settings.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RTTH</name>
              <description>On Die Termination high bit:
Selects the effective resistance for SDRAM on die termination. Valid values are:
00 = ODT disabled 01 = 75
10 = 150
11 = 50 (some vendors)</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AL</name>
              <description>Posted CAS Additive Latency: Setting additive latency that allows read and write commands to be issued to the SDRAM earlier than normal (refer to the SDRAM datasheet for details). Valid values are:
000 = 0
001 = 1
010 = 2
011 = 3
100 = 4
101 = 5
All other settings are reserved and should not be used. The maximum allowed value of AL is tRCD-1.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RTTL</name>
              <description>On Die Termination low bit:</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DIC</name>
              <description>Output Driver Impedance Control: Controls the output drive strength. Valid values are:
0 = Full strength
1 = Reduced strength</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DE</name>
              <description>DLL Enable/Disable: Enable (0) or disable (1) the DLL. DLL must be enabled for normal operation.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MR2</name>
          <description>“Mode Register 2/Extended Mode Register 2 (MR2/EMR2)” on page 114</description>
          <alternateGroup>UNION_MR2</alternateGroup>
          <addressOffset>0x5c</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RTTWR</name>
              <description>Dynamic ODT: Selects RTT for dynamic ODT. Valid values are: 00 = Dynamic ODT off
01 = RZQ/4
10 = RZQ/2
11 = Reserved</description>
              <bitOffset>9</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SRT</name>
              <description>Self-Refresh Temperature Range: Selects either normal (‘0’) or extended (‘1’) operating temperature range during self-refresh.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ASR</name>
              <description>Auto Self-Refresh: When enabled (‘1’), SDRAM automatically provides self-refresh power management functions for all supported operating temperature values.
Otherwise the SRT bit must be programmed to indicate the temperature range.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CWL</name>
              <description>CAS Write Latency: The delay between when the SDRAM registers a write command to when write data is available. Valid values are:
000 = 5 (tCK &gt; 2.5ns)
001 = 6 (2.5ns &gt; tCK &gt; 1.875ns)
010 = 7 (1.875ns &gt; tCK&gt; 1.5ns)
011 = 8 (1.5ns &gt; tCK &gt; 1.25ns)
100 = 9 (1.25ns &gt; tCK &gt; 1.07ns)
101 = 10 (1.07ns &gt; tCK &gt; 0.935ns)
110 = 11 (0.935ns &gt; tCK &gt; 0.833ns)
111 = 12 (0.833ns &gt; tCK &gt; 0.75ns)
All other settings are reserved and should not be used.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PASR</name>
              <description>Partial Array Self Refresh: Specifies that data located in areas of the array beyond the specified location will be lost if self refresh is entered.
Valid settings for 4 banks are:
000 = Full Array
001 = Half Array (BA[1:0] = 00 &amp; 01)
010 = Quarter Array (BA[1:0] = 00) 011 = Not defined
100 = 3/4 Array (BA[1:0] = 01, 10, &amp; 11)
101 = Half Array (BA[1:0] = 10 &amp; 11)
110 = Quarter Array (BA[1:0] = 11) 111 = Not defined
Valid settings for 8 banks are:
000 = Full Array
001 = Half Array (BA[2:0] = 000, 001, 010 &amp; 011)
010 = Quarter Array (BA[2:0] = 000, 001) 011 = 1/8 Array (BA[2:0] = 000)
100 = 3/4 Array (BA[2:0] = 010, 011, 100, 101, 110 &amp; 111)
101 = Half Array (BA[2:0] = 100, 101, 110 &amp; 111)
110 = Quarter Array (BA[2:0] = 110 &amp; 111)
111 = 1/8 Array (BA[2:0] 111)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EMR2</name>
          <description>No description available</description>
          <alternateGroup>UNION_MR2</alternateGroup>
          <addressOffset>0x5c</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SRF</name>
              <description>Self Refresh Rate: Enables, if set, high temperature self refresh rate.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DCC</name>
              <description>Duty Cycle Corrector: Enables, if set, duty cycle correction within SDRAM.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PASR</name>
              <description>Partial Array Self Refresh: Specifies that data located in areas of the array beyond the specified location will be lost if self refresh is entered.
Valid settings for 4 banks are:
000 = Full Array
001 = Half Array (BA[1:0] = 00 &amp; 01)
010 = Quarter Array (BA[1:0] = 00) 011 = Not defined
100 = 3/4 Array (BA[1:0] = 01, 10, &amp; 11)
101 = Half Array (BA[1:0] = 10 &amp; 11)
110 = Quarter Array (BA[1:0] = 11) 111 = Not defined
Valid settings for 8 banks are:
000 = Full Array
001 = Half Array (BA[2:0] = 000, 001, 010 &amp; 011)
010 = Quarter Array (BA[2:0] = 000, 001) 011 = 1/8 Array (BA[2:0] = 000)
100 = 3/4 Array (BA[2:0] = 010, 011, 100, 101, 110 &amp; 111)
101 = Half Array (BA[2:0] = 100, 101, 110 &amp; 111)
110 = Quarter Array (BA[2:0] = 110 &amp; 111)
111 = 1/8 Array (BA[2:0] 111)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MR3</name>
          <description>“Mode Register 3 (MR3)” on page 116</description>
          <alternateGroup>UNION_MR3</alternateGroup>
          <addressOffset>0x60</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MPR</name>
              <description>Multi-Purpose Register Enable: Enables, if set, that read data should come from the Multi-Purpose Register. Otherwise read data come from the DRAM array.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MPRLOC</name>
              <description>Multi-Purpose Register (MPR) Location: Selects MPR data location: Valid value are: 00 = Predefined pattern for system calibration
All other settings are reserved and should not be used.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EMR3</name>
          <description>No description available</description>
          <alternateGroup>UNION_MR3</alternateGroup>
          <addressOffset>0x60</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
          </fields>
        </register>
        <register>
          <name>ODTCR</name>
          <description>“ODT Configuration Register (ODTCR)” on page 117</description>
          <addressOffset>0x64</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>WRODT3</name>
              <description>No description available</description>
              <bitOffset>28</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRODT2</name>
              <description>No description available</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRODT1</name>
              <description>No description available</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRODT0</name>
              <description>Write ODT: Specifies whether ODT should be enabled (‘1’) or disabled (‘0’) on each of the up to four ranks when a write command is sent to rank n. WRODT0, WRODT1, WRODT2, and WRODT3 specify ODT settings when a write is to rank 0, rank 1, rank 2, and rank 3, respectively. The four bits of each field each represent a rank, the LSB being rank 0 and the MSB being rank 3. Default is to enable ODT only on rank being written to.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RDODT3</name>
              <description>No description available</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RDODT2</name>
              <description>No description available</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RDODT1</name>
              <description>No description available</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RDODT0</name>
              <description>Read ODT: Specifies whether ODT should be enabled (‘1’) or disabled (‘0’) on each of the up to four ranks when a read command is sent to rank n. RDODT0, RDODT1, RDODT2, and RDODT3 specify ODT settings when a read is to rank 0, rank 1, rank 2, and rank 3, respectively. The four bits of each field each represent a rank, the LSB being rank 0 and the MSB being rank 3. Default is to disable ODT during reads.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DTCR</name>
          <description>“Data Training Configuration Register (DTCR)” on page 118</description>
          <addressOffset>0x68</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFF7FFFFF</resetMask>
          <fields>
            <field>
              <name>RFSHDT</name>
              <description>Refresh During Training: A non-zero value specifies that a burst of refreshes equal to the number specified in this field should be sent to the SDRAM after training each rank except the last rank.</description>
              <bitOffset>28</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RANKEN</name>
              <description>Rank Enable: Specifies the ranks that are enabled for data-training. Bit 0 controls rank 0, bit 1 controls rank 1, bit 2 controls rank 2, and bit 3 controls rank 3. Setting the bit to ‘1’ enables the rank, and setting it to ‘0’ disables the rank.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DTEXD</name>
              <description>Data Training Extended Write DQS: Enables, if set, an extended write DQS whereby two additional pulses of DQS are added as post-amble to a burst of writes.
Generally this should only be enabled when running read bit deskew with the intention of performing read eye deskew prior to running write leveling adjustment.</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DTDSTP</name>
              <description>Data Training Debug Step: A write of 1 to this bit steps the data training algorithm through a single step. This bit is used to initiate one step of the data training algorithm in question.
This bit is self-clearing. To trigger the next step, this bit must be written to again. Note: The training steps must be repeated in order to get new data in the “Data Training Eye Data Register 0-1 (DTEDR0-1)” on page 122. For example, to see the
training results for a different lane, select that lane and repeat the training steps to
populate DTEDR0 and DTEDR1 with the correct data.</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DTDEN</name>
              <description>Data Training Debug Enable: Enables, if set, the data training single step debug mode.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DTDBS</name>
              <description>Data Training Debug Byte Select: Selects the byte during data training single step debug mode.
Note: DTDEN is not used to enable this feature.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DTWDQMO</name>
              <description>Data Training WDQ Margin Override: If set, the Training WDQ Margin value specified in DTCR[11:8] (DTWDQM) is used during data training. Otherwise the value is computed as ¼ of the ddr_clk period measurement found during calibration of the WDQ LCDL.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DTBDC</name>
              <description>Data Training Bit Deskew Centering: Enables, if set, eye centering capability during write and read bit deskew training.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DTWBDDM</name>
              <description>Data Training Write Bit Deskew Data Mask, if set, it enables write bit deskew of the data mask</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DTWDQM</name>
              <description>Training WDQ Margin: Defines how close to 0 or how close to 2*(wdq calibration_value) the WDQ LCDL can be moved during training. Basically defines how much timing margin.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DTCMPD</name>
              <description>Read Data Training Compare Data: Specifies, if set, that DQS gate training should also check if the returning read data is correct. Otherwise data-training only checks if the correct number of DQS edges were returned.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DTMPR</name>
              <description>Read Data Training Using MPR (DDR3 Only): Specifies, if set, that DQS gate training should use the SDRAM Multi-Purpose Register (MPR) register. Otherwise data-training is performed by first writing to some locations in the SDRAM and then reading them back.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DTRANK</name>
              <description>Data Training Rank: Select the SDRAM rank to be used during Read DQS gate training, Read/Write Data Bit Deskew, Read/Write Eye Training.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DTRPTN</name>
              <description>Data Training Repeat Number: Repeat number used to confirm stability of DDR write or read.
Note: The minimum value should be 0x4 and the maximum value should be 0x14.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DTAR0</name>
          <description>Data Training Address Register 0-3 (DTAR0-3)</description>
          <addressOffset>0x6c</addressOffset>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DTBANK</name>
              <description>Data Training Bank Address: Selects the SDRAM bank address to be used during data training.</description>
              <bitOffset>28</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DTROW</name>
              <description>Data Training Row Address: Selects the SDRAM row address to be used during data training.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DTCOL</name>
              <description>Data Training Column Address: Selects the SDRAM column address to be used during data training. The lower four bits of this address must always be “000”.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
